using System;
using System.Collections.Generic;
using System.IO;
using System.Text;
using System.Threading.Tasks;

namespace Prevod
{

    public enum SmerPrevodu
    {
        A2L,
        L2A
    }

    class Prevodnik
    {

        Dictionary<Char, Char> tab_azbuka_latinka;
        Dictionary<Char, Char> tab_latinka_azbuka;

        public Prevodnik()
        {



            InitA2L();
            InitL2A();



            //Console.WriteLine(Prevod("Подключение - oo", ref tab_azbuka_latinka ) );
            //Console.WriteLine(Prevod("Podklűčěniě - oo", ref tab_latinka_azbuka ) ) ;

        }




        void FileConvert(SmerPrevodu smerPrevodu, string InFileName, string InFileEncoding, string OutFileName, string OutFileEncoding)
        {
            var readFile = new StreamReader(InFileName, GetEncodingFromString(InFileEncoding));
            var writeFile = new StreamWriter(OutFileName, false, GetEncodingFromString(OutFileEncoding));
            string line;
            while ((line = readFile.ReadLine()) != null)
            {
                writeFile.WriteLine(Prevod(smerPrevodu, line));
            }
            readFile.Close();
            writeFile.Close();
        }

        Encoding GetEncodingFromString(string txt)
        {
            return Encoding.GetEncoding(txt.Replace("cp", "windows-").Replace("utf", "utf-").Replace("--", "-"));
        }

        public string Prevod(SmerPrevodu smerPrevodu, string txt)
        {
            var tab = smerPrevodu == SmerPrevodu.A2L ? tab_azbuka_latinka : tab_latinka_azbuka;
            char[] chars = txt.ToCharArray();
            for (int i = 0; i < chars.Length; i++)
            {
                if (tab.ContainsKey(chars[i]))
                {
                    chars[i] = tab[chars[i]];
                }
            }
            return new String(chars);
        }

        void InitA2L()
        {
            if (tab_azbuka_latinka != null)
            {
                return;
            }
            tab_azbuka_latinka = new Dictionary<char, char>(){
                /*{'\u0401','\xd4'},
                {'\u042d','E'},
                {'\u0391','A'},
                {'\u0410','A'},
                {'\u0413','G'},
                {'\u0412','V'},
                {'\u0415','\u011a'},
                {'\u0414','D'},
                {'\u0417','Z'},
                {'\u0416','\u017d'},
                {'\u0419','J'},
                {'\u0418','I'},
                {'\u041b','L'},
                {'\u041a','K'},
                {'\u041d','N'},
                {'\u041c','M'},
                {'\u041f','P'},
                {'\u041e','O'},
                {'\u03a1','R'},
                {'\u0420','R'},
                {'\u0423','U'},
                {'\u0422','T'},
                {'\u0425','H'},
                {'\u0424','F'},
                {'\u0427','\u010c'},
                {'\u0426','C'},
                {'\u0429','\u015e'},
                {'\u0428','\u0160'},
                {'\u042b','Y'},
                {'\u042a','~'},
                {'\u0442','t'},
                {'\u042c','^'},
                {'\u042f','\xc2'},
                {'\u042e','\u0170'},
                {'\u0431','b'},
                {'\u0430','a'},
                {'\u0433','g'},
                {'\u0432','v'},
                {'\u0435','\u011b'},
                {'\u0434','d'},
                {'\u0437','z'},
                {'\u0436','\u017e'},
                {'\u0439','j'},
                {'\u0438','i'},
                {'\u043b','l'},
                {'\u043a','k'},
                {'\u043d','n'},
                {'\u043c','m'},
                {'\u043f','p'},
                {'\u043e','o'},
                {'\u0441','s'},
                {'\u0440','r'},
                {'\u0443','u'},
                {'B','V'},
                {'\u0445','h'},
                {'\u0444','f'},
                {'\u0447','\u010d'},
                {'\u0446','c'},
                {'\u0449','\u015f'},
                {'H','N'},
                {'\u044b','y'},
                {'\u044a','~'},
                {'\u044d','e'},
                {'\u044c','^'},
                {'\u044f','\xe2'},
                {'\u044e','\u0171'},
                {'\u0451','\xf4'},
                {'\u0448','\u0161'},
                {'\u0411','B'},
                {'c','s'},
                {'\u0421','S'},
                {'\u03f9','S'},
                {'\u0415','\u011a'} // 0395 na 0415
                 */
                {'\u0401','\xd4'}, //Ё - Ô
                {'\u042d','E'}, //Э
                {'\u0391','A'}, //Α - alfa
                {'\u0410','A'}, //А - azbuka
                {'\u0413','G'}, //Г
                {'\u0412','V'}, //В
                {'\u0415','\u011a'}, //Е - Ě - azbuka
                {'\u0414','D'}, //Д
                {'\u0417','Z'}, //З
                {'\u0416','\u017d'}, //Ж - Ž
                {'\u0419','J'}, //Й
                {'\u0418','I'}, //И
                {'\u041b','L'}, //Л
                {'\u041a','K'}, //К
                {'\u041d','N'}, //Н
                {'\u041c','M'}, //М
                {'\u041f','P'}, //П
                {'\u041e','O'}, //О
                {'\u03a1','R'}, //Ρ - ró
                {'\u0420','R'}, //Р - azbuka
                {'\u0423','U'}, //У
                {'\u0422','T'}, //Т
                {'\u0425','H'}, //Х
                {'\u0424','F'}, //Ф
                {'\u0427','\u010c'}, //Ч - Č
                {'\u0426','C'}, //Ц
                {'\u0429','\u015e'}, //Щ - Ş
                {'\u0428','\u0160'}, //Ш - Š
                {'\u042b','Y'}, //Ы
                {'\u042a','~'}, //Ъ
                {'\u0442','t'}, //т
                {'\u042c','^'}, //Ь
                {'\u042f','\xc2'}, //Я - Â
                {'\u042e','\u0170'}, //Ю - Ű
                {'\u0431','b'}, //б
                {'\u0430','a'}, //а
                {'\u0433','g'}, //г
                {'\u0432','v'}, //в
                {'\u0435','\u011b'}, //е - ě
                {'\u0434','d'}, //д
                {'\u0437','z'}, //з
                {'\u0436','\u017e'}, //ж - ž
                {'\u0439','j'}, //й
                {'\u0438','i'}, //и
                {'\u043b','l'}, //л
                {'\u043a','k'}, //к
                {'\u043d','n'}, //н
                {'\u043c','m'}, //м
                {'\u043f','p'}, //п
                {'\u043e','o'}, //о
                {'\u0441','s'}, //с
                {'\u0440','r'}, //р
                {'\u0443','u'}, //у
                {'\u0445','h'}, //х
                {'\u0444','f'}, //ф
                {'\u0447','\u010d'}, //ч - č
                {'\u0446','c'}, //ц
                {'\u0449','\u015f'}, //щ - ş
                {'\u044b','y'}, //ы
                {'\u044a','~'}, //ъ
                {'\u044d','e'}, //э
                {'\u044c','^'}, //ь
                {'\u044f','\xe2'}, //я - â
                {'\u044e','\u0171'}, //ю - ű
                {'\u0451','\xf4'}, //ё - ô
                {'\u0448','\u0161'}, //ш - š
                {'\u0411','B'}, //Б
                {'\u0421','S'}, //С - azbuka
                {'\u03f9','S'}, //Ϲ - sigma
                {'\u0395','Ě'} //Ε - epsilon

            };
        }

        void InitL2A()
        {
            if (tab_latinka_azbuka != null)
            {
                return;
            }
            tab_latinka_azbuka = new Dictionary<char, char>(){
                /*{'\u010d','\u0447'},
                {'\u010c','\u0427'},
                {'\xf4','\u0451'},
                {'B','\u0411'},
                {'\u011b','\u0435'},
                {'\u011a','\u0395'},
                {'p','\u043f'},
                {'z','\u0437'},
                {'\u017e','\u0436'},
                {'^','\u044c'},
                {'\xe2','\u044f'},
                {'A','\u0410'},
                {'\u0161','\u0448'},
                {'C','\u0426'},
                {'\xc2','\u042f'},
                {'E','\u042d'},
                {'D','\u0414'},
                {'G','\u0413'},
                {'F','\u0424'},
                {'I','\u0418'},
                {'H','\u0425'},
                {'K','\u041a'},
                {'J','\u0419'},
                {'M','\u041c'},
                {'L','\u041b'},
                {'O','\u041e'},
                {'N','Н'},
                {'P','\u041f'},
                {'S','\u03f9'},
                {'R','\u0420'},
                {'U','\u0423'},
                {'\xd4','\u0401'},
                {'V','В'},
                {'Y','\u042b'},
                {'Z','\u0417'},
                {'\u015f','\u0449'},
                {'\u015e','\u0429'},
                {'a','\u0430'},
                {'\u0160','\u0428'},
                {'c','\u0446'},
                {'b','\u0431'},
                {'e','\u044d'},
                {'d','\u0434'},
                {'g','\u0433'},
                {'f','\u0444'},
                {'i','\u0438'},
                {'h','\u0445'},
                {'k','\u043a'},
                {'j','\u0439'},
                {'m','\u043c'},
                {'l','\u043b'},
                {'o','\u043e'},
                {'n','\u043d'},
                {'\u0171','\u044e'},
                {'\u0170','\u042e'},
                {'s','с'}, //\u0441
                {'r','\u0440'},
                {'u','\u0443'},
                {'t','\u0442'},
                {'v','\u0432'},
                {'y','\u044b'},
                {'~','\u044a'},
                {'\u017d','\u0416'},
                {'T','\u0422'}*/
                {'\u010d','\u0447'}, //č - ч
                {'\u010c','\u0427'}, //Č - Ч
                {'\xf4','\u0451'}, //ô - ё
                {'B','\u0411'}, //Б
                {'\u011b','\u0435'}, //ě - е
                {'\u011a','\u0415'}, //Ě - Е
                {'p','\u043f'}, //п
                {'z','\u0437'}, //з
                {'\u017e','\u0436'}, //ž - ж
                {'^','\u044c'}, //ь
                {'\xe2','\u044f'}, //â - я
                {'A','\u0410'}, //А
                {'\u0161','\u0448'},//š - ш
                {'C','\u0426'}, //Ц
                {'\xc2','\u042f'}, //Â - Я
                {'E','\u042d'}, //Э
                {'D','\u0414'}, //Д
                {'G','\u0413'}, //Г
                {'F','\u0424'}, //Ф
                {'I','\u0418'}, //И
                {'H','\u0425'}, //Х
                {'K','\u041a'}, //К
                {'J','\u0419'}, //Й
                {'M','\u041c'}, //М
                {'L','\u041b'}, //Л
                {'O','\u041e'}, //О
                {'N','\u041d'}, //Н
                {'P','\u041f'}, //П
                {'S','\u0421'}, //С
                {'R','\u0420'}, //Р
                {'U','\u0423'}, //У
                {'\xd4','\u0401'}, //Ô - Ё
                {'V','\u0412'}, //В
                {'Y','\u042b'}, //Ы
                {'Z','\u0417'}, //З
                {'\u015f','\u0449'}, //ş - щ
                {'\u015e','\u0429'}, //Ş - Щ
                {'a','\u0430'}, //а
                {'\u0160','\u0428'}, //Š - Ш
                {'c','\u0446'}, //ц
                {'b','\u0431'}, //б
                {'e','\u044d'}, //э
                {'d','\u0434'}, //д
                {'g','\u0433'}, //г
                {'f','\u0444'}, //ф
                {'i','\u0438'}, //и
                {'h','\u0445'}, //х
                {'k','\u043a'}, //к
                {'j','\u0439'}, //й
                {'m','\u043c'}, //м
                {'l','\u043b'}, //л
                {'o','\u043e'}, //о
                {'n','\u043d'}, //н
                {'\u0171','\u044e'}, //ű - ю
                {'\u0170','\u042e'}, //Ű - Ю
                {'s','\u0441'}, //с
                {'r','\u0440'}, //р
                {'u','\u0443'}, //у
                {'t','\u0442'}, //т
                {'v','\u0432'}, //в
                {'y','\u044b'}, //ы
                {'~','\u044a'}, //ъ
                {'\u017d','\u0416'}, //Ž - Ж
                {'T','\u0422'} //Т
            };
        }
    }
}
